let handler = m => m; 
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^تج$/i.test(m.text)) { 
     responses = [ 
                    
'*📍┇ا ي ر ي ن┇📍*',
'*📍┇س ي ش ي م ا ر و┇📍*',
'*📍┇ي و ز ي ه ا┇📍*',
'*📍┇م ا ي ك ي┇📍*',
'*📍┇ا ن و س┇📍*',
'*📍┇ا ل ف ر ي د و┇📍*',
'*📍┇ت ا ن ج ي ر و┇📍*',
'*📍┇ر ي ن غ و ك و┇📍*',
'*📍┇م ي ك ا س ا┇📍*',
'*📍┇ا ي ر و ي ن┇📍*',
'*📍┇س و ن غ┇📍*',
'*📍┇ا ي ت ش ي غ و┇📍*',
'*📍┇ ا و ر ا ه ا ر ا┇📍*',
'*📍┇ه و ك س┇📍*',
'*📍┇ل و ل و ش┇📍*',
'*📍┇ا ك ا ش ي┇📍*',
'*📍┇ ا و ت ش ي ه ا┇📍*',
'*📍┇ه ي ب ا ر ا┇📍*',
'*📍┇س ا ي ك ي┇📍*',
'*📍┇ه ي ن ا ت ا┇📍*',
'*📍┇ز ي ر و┇📍*',
'*📍┇م ي م ا و ر ا┇📍*',
'*📍┇ه و ر ي┇📍*',
'*📍┇ا ي م ا┇📍*',
'*📍┇ب ا ي ن┇📍*',
'*📍┇م ي ل ي و د ا س┇📍*',
'*📍┇ س ا ش ا┇📍*',
'*📍┇ك ي ر ي ت و┇📍*',
'*📍┇ ج ي ن ت و ك ي┇📍*',
'*📍┇ل و ي د┇📍*',
'*📍┇س ي ن ك و┇📍*',
'*📍┇ج ا ن┇📍*',
'*📍┇ت ا ك ت┇📍*',
'*📍┇ن ي ز و ك و┇📍*',
'*📍┇م و ز ا ن┇📍*',
'*📍┇ك و ز ي ت و┇📍*',
'*📍┇ك ا ب و ت و┇📍*',
'*📍┇ر ا ن┇📍*',
'*📍┇ ر ي ن┇📍*',
'*📍┇ا و ب ي ت و┇📍*',
'*📍┇ت و د و ر ك ي┇📍*',
'*📍┇ش و ت و┇📍*',
'*📍┇ب ا ك و غ و┇📍*',
'*📍┇ت ي ت ش┇📍*',
'*📍┇ب و ر و ت و┇📍*',
'*📍┇ا ي ت ا ت ش ي┇📍*',
'*📍┇ث و ر ┇📍*',
'*📍┇س ا ي ت ا م ا┇📍*',
'*📍┇ن و ز ي ل┇📍*',
'*📍┇د ر ا ك ي ن┇📍*',

     ];
    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 

 export default handler;