let handler = m => m; 
  
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^كت$/i.test(m.text)) { 
     responses = [ 
       '*⚡┇ايرين┇⚡*',  
 
       '*⚡┇اسيل┇⚡*',
  
       '*⚡┇الوكا┇⚡*',
   
       '*⚡┇ميهوك┇⚡*', 
   
       '*⚡┇ميتسوري┇⚡*',
  
       '*⚡┇اوباناي┇⚡*',
  
       '*⚡┇ساسكي┇⚡*',
   
       '*⚡┇اوروتشيمارو┇⚡*',
 
       '*⚡┇دوفلامينغو┇⚡*',
  
       '*⚡┇كيزيتو┇⚡*',
 
       '*⚡┇تاكت┇⚡*',

       '*⚡┇مايسترو┇⚡*',
 
       '*⚡┇اكاي┇⚡*',
 
       '*⚡┇لاكسوس┇⚡*',
 
       '*⚡┇زيريف┇⚡*',
 
       '*⚡┇ارثر┇⚡*',

       '*⚡┇كيلوا┇⚡*',
 
       '*⚡┇غون┇⚡*',

       '*⚡┇ايزونا┇⚡*',
 
       '*⚡┇ماي┇⚡*',

       '*⚡┇كيريتو┇⚡*',
  
       '*⚡┇اليفما┇⚡*',
 
       '*⚡┇تشاباشيرا┇⚡*',

       '*⚡┇ايانوكوجي┇⚡*',

       '*⚡┇كوشيدا┇⚡*',
  
       '*⚡┇هوريكيتا┇⚡*',
 
       '*⚡┇روكيا┇⚡*',
 
       '*⚡┇زاراكي┇⚡*',
  
       '*⚡┇ايزن┇⚡*',

       '*⚡┇كورابيكا┇⚡*',

       '*⚡┇ايتشيغو┇⚡*',
  
       '*⚡┇ايتاشي┇⚡*',

       '*⚡┇سارادا┇⚡*',

       '*⚡┇تانجيرو┇⚡*',
 
       '*⚡┇تيماري┇⚡*',
  
       '*⚡┇لوفي┇⚡*',

       '*⚡┇زورو┇⚡*',
 
       '*⚡┇ثوركيل┇⚡*',
  
       '*⚡┇اشيلاد┇⚡*',
 
       '*⚡┇كونان┇⚡*',
 
       '*⚡┇سانجي┇⚡*',
  
       '*⚡┇جيرين┇⚡*',
  
       '*⚡┇جيرايا┇⚡*',
 
       '*⚡┇مادارا┇⚡*',

       '*⚡┇اوبيتو┇⚡*',
 
       '*⚡┇ناروتو┇⚡*',
 
       '*⚡┇رينغوكو┇⚡*',

       '*⚡┇غيو┇⚡*',
 
       '*⚡┇موراساكيبارا┇⚡*',
 
       '*⚡┇كومي┇⚡*',
  
       '*⚡┇ريكا┇⚡*',
   
       '*⚡┇الكيورا┇⚡*',

       '*⚡┇اينو┇⚡*',

       '*⚡┇هيناتا┇⚡*',
  
       '*⚡┇اكامي┇⚡*',
   
       '*⚡┇زيرو┇⚡*',
    
       '*⚡┇استا┇⚡*',
 
       '*⚡┇يامي┇⚡*',

       '*⚡┇اكاشي┇⚡*',
 
       '*⚡┇نويل┇⚡*',
 
       '*⚡┇ليسنا┇⚡*',

       '*⚡┇ناخت┇⚡*',
  
       '*⚡┇ايما┇⚡*',
 
       '*⚡┇مايكي┇⚡*',
 
       '*⚡┇ميتسويا┇⚡*',
 
       '*⚡┇باجي┇⚡*',

       '*⚡┇كيسامي┇⚡*',
 
       '*⚡┇كازوتورا┇⚡*',

       '*⚡┇غوجو┇⚡*',
 
       '*⚡┇سوكونا┇⚡*',
 
       '*⚡┇باين┇⚡*',
 
       '*⚡┇ميليوداس┇⚡*',
 
       '*⚡┇اسكانور┇⚡*',
       '*⚡┇نوبارا┇⚡*',
       '*⚡┇يور┇⚡*', 
       '*⚡┇هيبارا┇⚡*',
 
       '*⚡┇دازاي┇⚡*',
   
       '*⚡┇تشويا┇⚡*',
  
       '*⚡┇ناراكو┇⚡*',
 
       '*⚡┇سيشومارو┇⚡*',
 
       '*⚡┇انيوشا┇⚡*',
    
       '*⚡┇كاغومي┇⚡*',
 
       '*⚡┇ياغامي لايت┇⚡*',

       '*⚡┇ريوك ال┇⚡*',
   
  
       '*⚡┇غوكو┇⚡*',
 
       '*⚡┇فيجيتا┇⚡*',
  
       '*⚡┇فيجيتورا┇⚡*',
  
       '*⚡┇كايدو┇⚡*',
 
       '*⚡┇اكاينو┇⚡*',
 
       '*⚡┇نامي┇⚡*',
    
       '*⚡┇سابو┇⚡*',
  
       '*⚡┇ميغومي┇⚡*',   
       '*⚡┇توجي┇⚡*',
'*⚡┇جان┇⚡*',
'*⚡┇شانكس┇⚡*',
'*⚡┇ايزومي┇⚡*',
'*⚡┇كروكودايل┇⚡*',
'*⚡┇روكسي┇⚡*',
'*⚡┇يادو┇⚡*',
'*⚡┇يوهان┇⚡*',
'*⚡┇غوتين┇⚡*',
'*⚡┇سايتاما┇⚡*',
'*⚡┇سايكي┇⚡*',
'*⚡┇ريكي┇⚡*',
'*⚡┇اوراهارا┇⚡*',
'*⚡┇بياكويا┇⚡*',
'*⚡┇ياماتو┇⚡*',
'*⚡┇فيلو┇⚡*',
'*⚡┇الفريدو┇⚡*',
'*⚡┇نيوغيت┇⚡*',
'*⚡┇نيزوكو┇⚡*',
'*⚡┇شينوبو┇⚡*',
'*⚡┇شينا┇⚡*',
'*⚡┇ماكيما┇⚡*',
'*⚡┇كيكيو┇⚡*',
'*⚡┇غارو┇⚡*',
'*⚡┇غاتس┇⚡*',
'*⚡┇ميكو┇⚡*',
'*⚡┇هانكوك┇⚡*',
'*⚡┇غابيمارو┇⚡*',
'*⚡┇كوكوشيبو┇⚡*',
'*⚡┇موزان┇⚡*',
'*⚡┇ميارا┇⚡*',
'*⚡┇ايكاكي┇⚡*',
'*⚡┇هيسوكا┇⚡*',
'*⚡┇هيستوريا┇⚡*',
'*⚡┇فلوك┇⚡*',
'*⚡┇لاك┇⚡*',    
'*⚡┇يونو┇⚡*',
'*⚡كارلوس┇┇⚡*',
'*⚡┇لولوش┇⚡*',
'*⚡┇انوس┇⚡*',
'*⚡┇كوروكو┇⚡*',
'*⚡┇اينوماكي┇⚡*',
'*⚡┇رين┇⚡*',
'*⚡┇ريم┇⚡*',
'*⚡┇الكيس┇⚡*',
'*⚡┇جيجوكوراكو┇⚡*',
'*⚡┇يوزوها┇⚡*',
'*⚡┇تاكيميتشي┇⚡*',
'*⚡┇ساغيري┇⚡*',
'*⚡┇كازوما┇⚡*',
'*⚡┇نانامي┇⚡*',
'*⚡┇ماهيتو┇⚡*',
'*⚡┇غريقيت┇⚡*',
'*⚡┇كارلو┇⚡*',
'*⚡┇سينكو┇⚡*',
'*⚡┇بروك┇⚡*',
'*⚡┇يوسوب┇⚡*',
'*⚡┇ساسوري┇⚡*',
'*⚡┇كيوراكو┇⚡*',
'*⚡┇اونوهانا┇⚡*',
'*⚡┇اوتو اي┇⚡*',
'*⚡┇ين جو┇⚡*',
'*⚡┇بيروس┇⚡*',
'*⚡┇ويس┇⚡*',
'*⚡┇غوهان┇⚡*',
'*⚡┇ميراجين┇⚡*',
'*⚡┇اكنولوغيا┇⚡*',
'*⚡┇ميتساكي┇⚡*',
'*⚡┇موساشي┇⚡*',
'*⚡┇سونغ┇⚡*',
'*⚡┇شادو┇⚡*',
'*⚡┇ارباستا┇⚡*',
'*⚡┇غيتو┇⚡*',
'*⚡┇ميزورهارا┇⚡*',
'*⚡┇ميدوريا┇⚡*',
'*⚡┇باكوغو┇⚡*',
'*⚡┇تشون يون┇⚡*',
'*⚡┇زاو فان┇⚡*',
'*⚡┇اليكسيا┇⚡*',
'*⚡┇ايساغي┇⚡*',
'*⚡┇ماين┇⚡*',
'*⚡┇ويليام┇⚡*',
'*⚡┇هولمز┇⚡*',
'*⚡┇تشارلوت┇⚡*',
'*⚡┇فانيتاس┇⚡*',
'*⚡┇يوسا┇⚡*',
'*⚡┇جينتوكي┇⚡*',
'*⚡┇غوثر┇⚡*',
'*⚡┇يونا┇⚡*',
'*⚡┇ايانو┇⚡*',
'*⚡┇هاك┇⚡*',
'*⚡┇ليفاي┇⚡*',
'*⚡┇فانغ يون┇⚡*',
'*⚡┇ياهيكو┇⚡*',
'*⚡┇ايروين┇⚡*',
'*⚡┇كانيكي┇⚡*',
'*⚡┇تنغن┇⚡*',
'*⚡┇توكا┇⚡*',
'*⚡┇ريمورو┇⚡*',
'*⚡┇بينيمارو┇⚡*',
'*⚡┇هاشيراما┇⚡*',
'*⚡┇ميكاسا┇⚡*',
'*⚡┇هوتارو┇⚡*',
'*⚡┇روبين┇⚡*',
'*⚡┇ميسا┇⚡*',
'*⚡┇لاو┇⚡*',
     ];
    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler;
